Let's code/src/InformationRegisters/ИТК_РезультатыТестирования/ИТК_РезультатыТестирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТК_РезультатыТестирования</name>
  <resources>
    <name>Выполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Код</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ИТК_Задачи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Let's code/src/InformationRegisters/ИТК_РезультатыТестирования/ManagerModule.bsl
#Если Сервер или ТолстыйКлиентОбычноеПриложение или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Процедура добавляет резульатат тестирования в регистр
// 
// Параметры:
//  Задача - СправочникСсылка.ИТК_Задача - задача тестирования
//  Пользователь - Строка - участник тестирования
//  Выполнена - Булево - тесты по задаче завершены успешно
//  ТекстАлгоритмаСервер - Строка - код алгоритма
//  Баллы - Число - количество баллов за верное решение
//
Процедура Добавить(Задача, Пользователь, Выполнена, ТекстАлгоритмаСервер, Баллы) Экспорт

	НоваяЗапись = РегистрыСведений.ИТК_РезультатыТестирования.СоздатьМенеджерЗаписи();   
	НоваяЗапись.Задача = Задача;
	НоваяЗапись.Пользователь = Пользователь;
	НоваяЗапись.Выполнена = Выполнена;
	НоваяЗапись.Код = ТекстАлгоритмаСервер;
	НоваяЗапись.КоличествоБаллов = Баллы;
	НоваяЗапись.Записать(Истина);

КонецПроцедуры

#КонецОбласти
		
#КонецЕсли
